EA/src/Documents/ИмпортДанныхКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ИмпортДанныхКонтрагентов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗакупкиКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиКонтрагентов</xr:Item>
				<xr:Item>InformationRegister.ОстаткиНоменклатурыКонтрагентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПоОстаткам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПоЗакупкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПоПродажам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Закупки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоставщикКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоставщикиКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/Enums/ВидыИмпортируемыхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыИмпортируемыхДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СправочникТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закупки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EA/src/Documents/ИмпортДанныхКонтрагентов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресТоваровВХранилище) Тогда
		ТаблицаТоваров = ПолучитьИзВременногоХранилища(Параметры.АдресТоваровВХранилище);
		
		Если Параметры.ВидИмпортируемыхДанных = Перечисления.ВидыИмпортируемыхДанных.Остатки Тогда
			
			Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
				Если СтрокаТаблицы.ЗагружаемыйНачальныйОстаток <> 0 Или СтрокаТаблицы.ЗагружаемыйКонечныйОстаток <> 0 Тогда
					СтрокаТЧ = Объект.Остатки.Добавить();
					СтрокаТЧ.НоменклатураКонтрагента = СтрокаТаблицы.НоменклатураПоставщика;
					СтрокаТЧ.НачальныйОстаток = СтрокаТаблицы.ЗагружаемыйНачальныйОстаток;
					СтрокаТЧ.КонечныйОстаток = СтрокаТаблицы.ЗагружаемыйКонечныйОстаток;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли Параметры.ВидИмпортируемыхДанных = Перечисления.ВидыИмпортируемыхДанных.Закупки Тогда
			
			Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
				Если СтрокаТаблицы.Количество <> 0 Тогда
					СтрокаТЧ = Объект.Закупки.Добавить();
					СтрокаТЧ.Дата                    = СтрокаТаблицы.ЗагружаемаяДата;
					СтрокаТЧ.НоменклатураКонтрагента = СтрокаТаблицы.НоменклатураПоставщика;
					СтрокаТЧ.ПоставщикКонтрагента    = СтрокаТаблицы.Поставщик;
					СтрокаТЧ.Количество              = СтрокаТаблицы.Количество;
					СтрокаТЧ.Цена                    = СтрокаТаблицы.Цена;
					СтрокаТЧ.Сумма                   = ?(СтрокаТаблицы.Сумма = 0, СтрокаТЧ.Количество * СтрокаТЧ.Цена, СтрокаТаблицы.Сумма);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли Параметры.ВидИмпортируемыхДанных = Перечисления.ВидыИмпортируемыхДанных.Продажи Тогда
			
			Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
				Если СтрокаТаблицы.Количество <> 0 Тогда
					СтрокаТЧ = Объект.Продажи.Добавить();
					СтрокаТЧ.Дата                    = СтрокаТаблицы.ЗагружаемаяДата;
					СтрокаТЧ.НоменклатураКонтрагента = СтрокаТаблицы.НоменклатураПоставщика;
					СтрокаТЧ.Количество              = СтрокаТаблицы.Количество;
					СтрокаТЧ.ЦенаЗакупки             = СтрокаТаблицы.ЗагружаемаяЦенаЗакупки;
					СтрокаТЧ.ЦенаПродажи             = СтрокаТаблицы.ЗагружаемаяЦенаПродажи;
					СтрокаТЧ.СуммаЗакупки            = СтрокаТЧ.Количество * СтрокаТЧ.ЦенаЗакупки;
					СтрокаТЧ.СуммаПродажи            = СтрокаТЧ.Количество * СтрокаТЧ.ЦенаПродажи;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Остатки.Количество() <> 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОстатки;
	ИначеЕсли Объект.Закупки.Количество() <> 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗакупки;
	ИначеЕсли Объект.Продажи.Количество() <> 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПродажи;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьДатуПродажи(Команда)
	
	ПоказатьВводДаты(
		Новый ОписаниеОповещения("УстановитьДатуПродажиЗавершение", ЭтотОбъект),,
		НСтр("ru='Укажите дату продажи'"),
		ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуЗакупки(Команда)
	
	ПоказатьВводДаты(
		Новый ОписаниеОповещения("УстановитьДатуЗакупкиЗавершение", ЭтотОбъект),,
		НСтр("ru='Укажите дату закупки'"),
		ЧастиДаты.Дата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДатуПродажиЗавершение(Дата, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект.Продажи Цикл
		СтрокаТЧ.Дата = Дата;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуЗакупкиЗавершение(Дата, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект.Закупки Цикл
		СтрокаТЧ.Дата = Дата;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
